#include <stdio.h>

/*  测试用例：  输入两个数：20100122201001221234567890，2010012220100122
	预期结果：  输出：20100122203011233454668012 
	实际结果：	输出：20100122203011233454668012 */ 

int main()
{
	int a[50] = {0};  //两个非负整数 
	int b[50] = {0};
	int c[51] = {0};		//相加之后的非负整数
	int d[50]; 		//用于调节数组中数字的正确位置 
	int i = 0;
	int n;   //一位一位输入数字 
	int r, q;  //负责辅助数组之间的加法
	r = 0;
	
	
	printf("请输入两个不超过50位的非负整数（最高位不为0）；\n");
	printf("请输入第一个非负整数：");
	while( ( n = getchar() ) !=  '\n')		//输入并保存数字 
	{
		d[i] = n-48;
		i++; 
	}
	for(n=0; n<i; n++)
		a[n] = d[i-n-1];
	
	i = 0;
	printf("请输入第二个非负整数：");
	while( ( n = getchar() ) !=  '\n')
	{
		d[i] = n-48;
		i++; 
	}
	for(n=0; n<i; n++)
		b[n] = d[i-n-1];
	
	for(i=0; i<50; i++)	//进行加法的计算 
	{
		q = (a[i]+b[i]+r) % 10;
 		r = (a[i]+b[i]+r) / 10;
		if(i == 49)
			c[50] = r;  
		c[i] = q; 
	}
	
	printf("两个整数相加的值为");
	i = 0; 
	while( c[50-i] == 0)
	{
		i++;
	}
	for(i; i<=50; i++)
	{
	
		printf("%d", c[50-i]);
	}
	printf("\n按q键退出");
	while(getchar() != 'q')
	;
}
